Public Attributes | List of all members
API_StairBoundaryVertexData Struct Reference
Element Manager API
Stores data of a stair boundary vertex. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_StairPolyTypeID  | type
The type of the boundary polyline section.
API_StairPolyGeometryTypeID  | geometryType
The geometry type of the boundary polyline section.
UInt32  | subElemId
The subelement identifier of the boundary polyline section.
bool  | isTop
The section describes the top of the subelement.
bool  | isBottom
The section describes the bottom of the subelement.
bool  | isFront
The section describes the front of the subelement.
bool  | isBack
The section describes the back of the subelement.
UInt32  | customId
Internal identifier.
double  | zValue
Detailed Description
Stores data of a stair boundary vertex.
Member Data Documentation
◆ customId
 API_StairBoundaryVertexData::customId
Internal identifier.
◆ geometryType
 API_StairBoundaryVertexData::geometryType
The geometry type of the boundary polyline section.
◆ isBack
 API_StairBoundaryVertexData::isBack
The section describes the back of the subelement.
◆ isBottom
 API_StairBoundaryVertexData::isBottom
The section describes the bottom of the subelement.
◆ isFront
 API_StairBoundaryVertexData::isFront
The section describes the front of the subelement.
◆ isTop
 API_StairBoundaryVertexData::isTop
The section describes the top of the subelement.
◆ subElemId
 API_StairBoundaryVertexData::subElemId
The subelement identifier of the boundary polyline section.
◆ type
 API_StairBoundaryVertexData::type
The type of the boundary polyline section.
◆ zValue
 double API_StairBoundaryVertexData::zValue